controllers/GiaoVienController.php

SELECT * FROM `mon_hoc`
SELECT * FROM `user`
---
    public function actionUpdate($id)
    {
        $viewModel = $this->findViewModel($id);
        $model = $this -> findModel($id);
//        $lopModel = $this -> findClassModel(Lop::findOne(['ten_lop' => $viewModel->ten_lop])->id);
        $lopModel = (Lop::find()->all());
        $monModel = MonHoc::find()->all();
        $userModel = User::find()->all();

SELECT * FROM `giao_vien` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = GiaoVien::findOne($id)) !== null)

SELECT * FROM `quan_ly_giao_vien` WHERE `id`='1'
---
    protected function findViewModel($id)
    {
        if (($model = QuanLyGiaoVien::findOne(['id' => $id])) !== null)

SELECT * FROM `role` WHERE `id`=2
---
    protected function findRoleModel($id)
    {
        if (($model = Role::findOne(['id' => $id])) !== null)