controllers/GiaoVienController.php

    public function actionUpdate($id)
    {
        $request = Yii::$app->request;
        $model = $this->findModel($id);
        $modelClass = Lop::find()->all();
        $modelSubject = MonHoc::find()->all();
---
SELECT EXISTS(SELECT * FROM `lop` WHERE `lop`.`id`='21')
SELECT EXISTS(SELECT * FROM `mon_hoc` WHERE `mon_hoc`.`id`='1')